#### BONUS: 
As you examine the data, you are overcome with a creeping suspicion that the dataset is fake. You surmise that your boss handed you spurious data in order to test the data engineering skills of a new employee. To confirm your hunch, you decide to take the following steps to generate a visualization of the data, with which you will confront your boss:

1. Import the SQL database into Pandas. (Yes, you could read the CSVs directly in Pandas, but you are, after all, trying to prove your technical mettle.) This step may require some research. Feel free to use the code below to get started. Be sure to make any necessary modifications for your username, password, host, port, and database name:

   ```sql
   from sqlalchemy import create_engine
   engine = create_engine('postgresql://localhost:5432/<your_db_name>')
   connection = engine.connect()
   ```
 2. Create a histogram to visualize the most common salary ranges for employees.

3. Create a bar chart of average salary by title.

In [1]:
import pandas as pd
import os
import numpy as np
import matplotlib.pyplot as plt
import psycopg2
from sqlalchemy import create_engine
from sqlalchemy import Column, Integer, String, Float 
from sqlalchemy.ext.declarative import declarative_base
Base = declarative_base()

In [2]:
#Create an engine instance
#importing data 
database_path = "../data"

engine = create_engine("postgresql://postgres:postgres@Localhost:5432/employees_db", pool_size=10, max_overflow=20)
conn = engine.connect()

In [3]:
emp_db = pd.read_sql("SELECT * FROM employees", conn)
title_db = pd.read_sql("SELECT * FROM titles", conn)
title_db

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer
5    e0004    Technique Leader
6    m0001             Manager

In [4]:
salary_db = pd.read_sql("SELECT * FROM salaries", conn)
salary_db.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [5]:
average_salary = salary_db.groupby("titles").agg({"salary":"mean"})
average_salary

KeyError: 'titles'